export default {
    // الإعدادات العامة
    settings: {
        prefix: ".", // البادئة الافتراضية للأوامر
        self: false, // هل البوت يستجيب لنفسه؟
        autoread: true, // هل البوت يقرأ الرسائل تلقائيًا؟
        restrict: true, // هل البوت مقيد في مجموعات معينة؟
        autorestart: true, // هل البوت يعيد التشغيل تلقائيًا؟
        anticall: true, // هل البوت يمنع المكالمات غير المرغوب فيها؟
        image: true, // هل البوت يسمح بإرسال الصور؟
        gif: false, // هل البوت يسمح بإرسال GIF؟
        teks: true, // هل البوت يسمح بإرسال النصوص؟
        doc: false, // هل البوت يسمح بإرسال المستندات؟
        button: false, // هل البوت يدعم الأزرار؟
        backupDB: false, // هل البوت يقوم بعمل نسخ احتياطية لقاعدة البيانات؟
    },
};